package study20260102;

public class MainMethod {

	public static void main(String[] args) {

	}

}

/*	제어문
 *
 *	조건문 - if (+ else), switch
 *
 *	if = 참과 거짓 / 가장 많이 사용되는 조건문 / 반드시 조건이 필요하다. 코드로 조건식을 잘 만드는 것이 중요
 *		ㄴ 간단한 조건식 : 기준값이 있음 (예: 놀이기구 탑승 제한 키(신장))
 *		ㄴ 조건식은 if 뒤에만 올 수 있으며, else 뒤에는 조건식을 넣을 수 없다.
 *
 *		1. 조건에 따른 결과가 하나일 경우
 *		if( 조건식 ) {
 *			조건식이 참일 경우 실행할 코드;
 *		}
 *
 *		2. 조건에 따른 결과가 두개일 경우
 *		if( 조건식 ) {
 *			조건식이 참일 경우 실행할 코드;
 *		} else {
 *			조건식이 거짓일 경우 실행할 코드;
 *		}
 *
 *		3.
 *		if( 조건식1 ) {
 *			조건식1이 참일 경우 실행
 *		} else {
 *			조건식1이 거짓일 경우 실행
 *			if ( 조건식2 ) {
 *				조건식2가 참일 경우 실행
 *			}
 *		}
 *		
 *	switch = 선택 <- 주로 메뉴에 사용 (사용자의 선택에 따라 동작) / 한 프로그램에서 가장 큰 틀을 차지하는 조건문
 *
 *
 *	반복문 - for, while, do while
 *
 */